
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ВложитьФайл(Команда)
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ЗарегестрироватьЗадачуВТрекере(Команда)
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегестрироватьЗадачуВТрекереНаСервере(Задача, ОтчетОВыполении)
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьСписокПроектов(Команда)
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьСписокПроектовНаСервере()
КонецПроцедуры

